Table of Contents
 Enum IdeaBeamSegmentModelType
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public enum IdeaBeamSegmentModelType
Fields
LoadedInX = 6
N
LoadedInXY = 4
N-Vy-Mz
LoadedInXYZ = 0
N-Vy-Vz-Mx-My-Mz
LoadedInXYZ_NoBending = 32
N + Vz
LoadedInXZ = 2
N-Vz-My
Rod = 18
Rod
Fields
 Name |  Description
 LoadedInX = 6
N
 LoadedInXY = 4
N-Vy-Mz
 LoadedInXYZ = 0
N-Vy-Vz-Mx-My-Mz
 LoadedInXYZ_NoBending = 32
N + Vz
 LoadedInXZ = 2
N-Vz-My
 Rod = 18
Rod
 Edit this page